# WEEK- 2.3 : PANDAS &  Exploratory data analysis on cars data

## PANDAS: The Most Popular and Useful Python Library for Data Science

1.Pandas is an open-source Python Library
2.provides high-performance data manipulation and analysis tool
3.It provides fast, expressive, and flexible data structures 
  to easily (and intuitively) work with structured 
  (tabular, multidimensional, potentially heterogeneous)and time-series data.
4.The name Pandas is derived from the word Panel Data –  an Econometrics from Multidimensional data.

1.Pandas is high performance data analystical tool which used for large data sets.
2.It will accept different file formats. Data represents in tabular form.
3.Used extensively for data mugging and preparation

Key Features of Pandas

1.Fast and efficient DataFrame object with default and customized indexing.
2.Tools for loading data into in-memory data objects from different file formats.
3.Data alignment and integrated handling of missing data.
4.Reshaping and pivoting of date sets.
5.Label-based slicing, indexing and subsetting of large data sets.
6.Columns from a data structure can be deleted or inserted.
7.Group by data for aggregation and transformations.
8.High performance merging and joining of data.

![](pandas.jpg)

## PANDAS DATA STRUCTURES

Pandas uses three data structures −

1.Series (1-dimensional) - input is list
2.DataFrame (2-dimensional)- input is list/dictionary/series/any data frame
3.Panel   (Miulti dimensional)

Note: These data structures are built on top of Numpy array, which means they are fast.

Series:

    Series is a one dimensional numpy array with axis labels 
and capable of handling data of any type (integer, string, float and even python objects). 
The axis labels are called as index. In simpler terms, 
series is nothing but a column in a excel spreadsheet.

created using Series() constructor which has many parameters 
syntax:
pandas.Series( data, index, dtype)


data takes various forms like ndarray, list, constants
index

Index values must be unique and hashable, same length as data. Default np.arrange(n) if no index is passed.
dtype

dtype is for data type. If None, data type will be inferred

In [3]:
#creating empty series
import pandas as pd
import numpy as np
ser = pd.Series()   #(data, index=index_val)
ser

Series([], dtype: float64)

In [ ]:
# creating series from an array

data = np.array(['a','b','c','d'])
s = pd.Series(data)
print(s)

# We did not pass any index, so by default, it assigned the indexes ranging from 0 to len(data)-1,
# i.e., 0 to 3.

0    a
1    b
2    c
3    d
dtype: object

In [ ]:
#indexing series
data = np.array(['a','b','c','d'])
s = pd.Series(data,index=[100,101,102,103])
print(s)

print(s[101]) #accessing using index

100    a
101    b
102    c
103    d
dtype: object
b

In [ ]:
# type of series
print(type(s))

<class 'pandas.core.series.Series'>

In [ ]:
#creating series from dictionary
import pandas as pd
import numpy as np
data = {'a' : 0., 'b' : 1., 'c' : 2.}
s = pd.Series(data)
print(s)

# Dictionary keys are indexes.

a    0.0
b    1.0
c    2.0
dtype: float64

In [ ]:
# accessing and slicing
print(s[0])
print("slice of series :", "\n",s[:2])

0.0
slice of series :
 a    0.0
b    1.0
dtype: float64

DataFrame:

Dataframe is a two dimensional size-mutable, 
Dataframes consists of three components: rows,columns and the data.

Features of DataFrame

1.Potentially columns are of different types
2.Size – Mutable
3.Labeled axes (rows and columns)
4.Can Perform Arithmetic operations on rows and columns

#### DataFrame

#syntax
pandas.DataFrame( data, index, columns, dtype)

In [ ]:
# empty dataFrame
import pandas as pd
df = pd.DataFrame()
print (df)

Empty DataFrame
Columns: []
Index: []

In [ ]:
type(df)

pandas.core.frame.DataFrame

A pandas DataFrame can be created using various inputs like −

1.Lists
2.dict
3.Series
4.Numpy ndarrays
5.Another DataFrame

In [ ]:
#Create DataFrame using Lists
import pandas as pd
data = [1,2,3,4,5]
df = pd.DataFrame(data)
print (df)

   0
0  1
1  2
2  3
3  4
4  5

In [ ]:
# Create DataFrame from list of lists
import pandas as pd
data = [['Alex',10],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)# use index also
print (df)

     Name   Age
0    Alex  10.0
1     Bob  12.0
2  Clarke  13.0

In [ ]:
# observe NAN values, NOT A NUMBER, missing values
import pandas as pd
data = [['Alex',],['Bob',12],['Clarke',13]]
df = pd.DataFrame(data,columns=['Name','Age'],dtype=float)# use index also
print (df)

     Name   Age
0    Alex   NaN
1     Bob  12.0
2  Clarke  13.0

In [ ]:
#selection, column selection
print(df['Name'])

0      Alex
1       Bob
2    Clarke
Name: Name, dtype: object

In [ ]:
#adding new column
df['avg']=[1,2,3]
print(df)

     Name   Age  avg
0    Alex   NaN    1
1     Bob  12.0    2
2  Clarke  13.0    3

In [ ]:
#deleting a column
print ("Deleting the first column using DEL function:")
del df['Age']
print (df)

Deleting the first column using DEL function:
     Name  avg
0    Alex    1
1     Bob    2
2  Clarke    3

# dataframe data selection/slicing using iloc and loc
loc: is label-based, which means that we have to specify the name of the rows and columns 
     that we need to filter out.

iloc: is integer index-based. 
    So here, we have to specify rows and columns 
    by their integer index.

In [ ]:
# importing pandas and numpy
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame(
    {
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', '', 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [ ]:
# select all rows with a condition
data.loc[data.age >= 15]

   age section    city gender favourite_color
1   22       B   Delhi      F
3   21       B   Delhi      M             NaN
6   17       A  Mumbai      F             red

In [ ]:
# select with multiple conditions
data.loc[(data.age >= 12) & (data.gender == 'M')]

   age section    city gender favourite_color
3   21       B   Delhi      M             NaN
4   12       B  Mumbai      M           black

In [ ]:
#slice
data.loc[1:3]

   age section    city gender favourite_color
1   22       B   Delhi      F
2   13       C  Mumbai      F          yellow
3   21       B   Delhi      M             NaN

In [ ]:
# update a column with condition
data.loc[(data.age >= 12), ['section']] = 'M'
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       M    Delhi      F
2   13       M   Mumbai      F          yellow
3   21       M    Delhi      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
# update multiple columns with condition
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

In [ ]:
# Select rows with indices using iloc
# select rows with indexes
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow

In [ ]:
# select rows with indexes
data.iloc[[0,2]]

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow

In [ ]:
# select a range of rows....slice
data.iloc[1:3]

   age section    city gender favourite_color
1   22       S    Pune      F
2   13       M  Mumbai      F          yellow

In [ ]:
# select a range of rows and columns
data.iloc[1:3,2:4]

     city gender
1    Pune      F
2  Mumbai      F

In [ ]:
# Drop rows with label 1
data = data.drop(1)
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
2   13       M   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       M   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       M   Mumbai      F             red

## PANDAS WORKING WITH DATASETS

DataSets - It basically refers Data extracted for Analysis from various Sources

Structured Data - RDBMS tables,Excel,csv,
Semi-Structured - Json , XML
Unstructured -    Text , Raw Images

difference between dataFrame and datasets:
     
1. DataFrames are pandas envirnomental structured objects(variables) where structured/ unstructured 
   datasets can be loaded
2. typed-datasets and untyped-dataFrames

In [ ]:
# import the needed libraies
import numpy as np
import pandas as pd
data=pd.read_csv('cars.csv')

In [ ]:
#print data
data

       HP        MPG  VOL          SP         WT
0    49.0  53.700681   89  104.185353  28.762059
1    55.0  50.013401   92  105.461264  30.466833
2    55.0  50.013401   92  105.461264  30.193597
3    70.0  45.696322   92  113.461264  30.632114
4    53.0  50.504232   92  104.461264  29.889149
..    ...        ...  ...         ...        ...
76  322.0  36.900000   50  169.598513  16.132947
77  238.0  19.197888  115  150.576579  37.923113
78  263.0  34.000000   50  151.598513  15.769625
79  295.0  19.833733  119  167.944460  39.423099
80  236.0  12.101263  107  139.840817  34.948615

[81 rows x 5 columns]

In [ ]:
#load excel and print
data=pd.read_excel('store.xlsx')  
data

,Category,City,Country,Customer Name,Order Date,Order ID,Postal Code,Product Name,Region,Segment,Ship Date,Ship Mode,State,Sub-Category,Discount,Number of Records,Profit,Profit Ratio,Quantity,Sales
0,Furniture,Henderson,United States,Claire Gute,2013-11-09,CA-2013-152156,42420,Bush Somerset Collection Bookcase,South,Consumer,2013-11-12,Second Class,Kentucky,Bookcases,0.00,1,$42,0.16,2,$262
1,Furniture,Henderson,United States,Claire Gute,2013-11-09,CA-2013-152156,42420,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",South,Consumer,2013-11-12,Second Class,Kentucky,Chairs,0.00,1,$220,0.30,3,$732
2,Office Supplies,Los Angeles,United States,Darrin Van Huff,2013-06-13,CA-2013-138688,90036,Self-Adhesive Address Labels for Typewriters b...,West,Corporate,2013-06-17,Second Class,California,Labels,0.00,1,$7,0.47,2,$15
3,Furniture,Fort Lauderdale,United States,Sean O'Donnell,2012-10-11,US-2012-108966,33311,Bretford CR4500 Series Slim Rectangular Table,South,Consumer,2012-10-18,Standard Class,Florida,Tables,0.45,1,-$383,-0.40,5,$958
4,Office Supplies,Fort Lauderdale,United States,Sean O'Donnell,2012-10-11,US-2012-108966,33311,Eldon Fold 'N Roll Cart System,South,Consumer,2012-10-18,Standard Class,Florida,Storage,0.20,1,$3,0.11,2,$22
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9989,Furniture,Miami,United States,Tom Boeckenhauer,2011-01-22,CA-2011-110422,33180,Ultra Door Pull Handle,South,Consumer,2011-01-24,Second Class,Florida,Furnishings,0.20,1,$4,0.16,3,$25
9990,Furniture,Costa Mesa,United States,Dave Brooks,2014-02-27,CA-2014-121258,92627,Tenex B1-RE Series Chair Mats for Low Pile Car...,West,Consumer,2014-03-04,Standard Class,California,Furnishings,0.00,1,$16,0.17,2,$92
9991,Technology,Costa Mesa,United States,Dave Brooks,2014-02-27,CA-2014-121258,92627,Aastra 57i VoIP phone,West,Consumer,2014-03-04,Standard Class,California,Phones,0.20,1,$19,0.08,2,$259
9992,Office Supplies,Costa Mesa,United States,Dave Brooks,2014-02-27,CA-2014-121258,92627,"It's Hot Message Books with Stickers, 2 3/4"" x 5""",West,Consumer,2014-03-04,Standard Class,California,Paper,0.00,1,$13,0.45,4,$30
9993,Office Supplies,Westminster,United States,Chris Cortes,2014-05-05,CA-2014-119914,92683,"Acco 7-Outlet Masterpiece Power Center, Wihtou...",West,Consumer,2014-05-10,Second Class,California,Appliances,0.00,1,$73,0.30,2,$243

In [ ]:
#loading datasets from a link
df = pd.read_csv(
    'https://vincentarelbundock.github.io/Rdatasets/'
    'csv/datasets/OrchardSprays.csv')
print(df)

    Unnamed: 0  decrease  rowpos  colpos treatment
0            1        57       1       1         D
1            2        95       2       1         E
2            3         8       3       1         B
3            4        69       4       1         H
4            5        92       5       1         G
..         ...       ...     ...     ...       ...
59          60        14       4       8         B
60          61        86       5       8         H
61          62        55       6       8         E
62          63         3       7       8         A
63          64        19       8       8         C

[64 rows x 5 columns]

## EXPLORATORY DATA ANALYSIS : on cars data

In [ ]:
#load cars data
import numpy as np
import pandas as pd
cars_data=pd.read_csv('cars.csv')

In [ ]:
# display first 5 rows
cars_data.head(5)

     HP        MPG  VOL          SP         WT
0  49.0  53.700681   89  104.185353  28.762059
1  55.0  50.013401   92  105.461264  30.466833
2  55.0  50.013401   92  105.461264  30.193597
3  70.0  45.696322   92  113.461264  30.632114
4  53.0  50.504232   92  104.461264  29.889149

In [ ]:
# number of rows and columns
cars_data.shape

(81, 5)

In [ ]:
cars_data.columns

Index(['HP', 'MPG', 'VOL', 'SP', 'WT'], dtype='object')

In [ ]:
cars_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 81 entries, 0 to 80
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   HP      80 non-null     float64
 1   MPG     80 non-null     float64
 2   VOL     81 non-null     int64
 3   SP      80 non-null     float64
 4   WT      79 non-null     float64
dtypes: float64(4), int64(1)
memory usage: 3.3 KB

In [ ]:
cars_data.dtypes

HP     float64
MPG    float64
VOL      int64
SP     float64
WT     float64
dtype: object

In [ ]:
cars_data.describe()

               HP        MPG         VOL          SP         WT
count   80.000000  80.000000   81.000000   80.000000  79.000000
mean   117.787500  34.373469   98.765432  121.636661  32.392773
std     57.401472   9.178506   22.301497   14.244180   7.562151
min     49.000000  12.101263   50.000000   99.564907  15.712859
25%     83.250000  27.730755   89.000000  113.941189  29.598147
50%    100.000000  35.152727  101.000000  118.248847  32.734518
75%    140.000000  39.661224  113.000000  126.452862  37.482907
max    322.000000  53.700681  160.000000  169.598513  52.997752

In [ ]:
cars_data.describe().T

,count,mean,std,min,25%,50%,75%,max
HP,80.0,117.787500,57.401472,49.000000,83.250000,100.000000,140.000000,322.000000
MPG,80.0,34.373469,9.178506,12.101263,27.730755,35.152727,39.661224,53.700681
VOL,81.0,98.765432,22.301497,50.000000,89.000000,101.000000,113.000000,160.000000
SP,80.0,121.636661,14.244180,99.564907,113.941189,118.248847,126.452862,169.598513
WT,79.0,32.392773,7.562151,15.712859,29.598147,32.734518,37.482907,52.997752

In [ ]:
dup=cars_data.duplicated()
print(dup)

0     False
1     False
2     False
3     False
4     False
      ...
76    False
77    False
78    False
79    False
80    False
Length: 81, dtype: bool

In [ ]:
print(dup.sum())

0

In [ ]:
#slice of rows and columns
cars_data.loc[0:5, 'HP':'MPG']

     HP        MPG
0  49.0  53.700681
1  55.0  50.013401
2  55.0  50.013401
3  70.0  45.696322
4  53.0  50.504232
5  70.0  45.696322

In [ ]:
#using iloc slice
cars_data.iloc[0:5, 0:3]

     HP        MPG  VOL
0  49.0  53.700681   89
1  55.0  50.013401   92
2  55.0  50.013401   92
3  70.0  45.696322   92
4  53.0  50.504232   92

In [ ]:
# first and last rows of df
print(cars_data[-1:])
print(cars_data[:1])

       HP        MPG  VOL          SP         WT
80  236.0  12.101263  107  139.840817  34.948615
     HP        MPG  VOL          SP         WT
0  49.0  53.700681   89  104.185353  28.762059

In [ ]:
# each colmn max To apply functions to each column, use apply():
cars_data.apply(np.max)

HP     322.000000
MPG     53.700681
VOL    160.000000
SP     169.598513
WT      52.997752
dtype: float64

## Exploring null values/ missing values

In [ ]:
#isnull returns boolean
cars_data.isnull()

       HP    MPG    VOL     SP     WT
0   False  False  False  False  False
1   False  False  False  False  False
2   False  False  False  False  False
3   False  False  False  False  False
4   False  False  False  False  False
..    ...    ...    ...    ...    ...
76  False  False  False  False  False
77  False  False  False  False  False
78  False  False  False  False  False
79  False  False  False  False  False
80  False  False  False  False  False

[81 rows x 5 columns]

In [ ]:
cars_data.isnull().sum() # missing values in each feature

HP     1
MPG    1
VOL    0
SP     1
WT     2
dtype: int64

In [ ]:
##NEXT: week 2.3-EXPLORATORY DATA ANALYSIS-VISUALIZATION-hr_attrition data